tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/coarse/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
// Unreported Stage-1 initialization: strictly positive numerical floor only.
// It is not derived from the finite-pocket branch's 0.06 m/s velocity.
internalField   uniform 1e-06;

boundaryField
{
    waterInlet   { type fixedValue; value uniform 1e-06; }
    waterOutlet  { type inletOutlet; inletValue uniform 1e-06; value uniform 1e-06; }
    airInlet     { type zeroGradient; }
    ambientFloor { type inletOutlet; inletValue uniform 1e-06; value uniform 1e-06; }
    ambientSides { type inletOutlet; inletValue uniform 1e-06; value uniform 1e-06; }
    ambientTop   { type inletOutlet; inletValue uniform 1e-06; value uniform 1e-06; }
    walls        { type kqRWallFunction; value uniform 1e-06; }
    frontAndBack { type empty; }
}
