tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/coarse/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

phases          (water air);
pMin            80000;

// Source says surface tension is included but does not list its value.
sigma
{
    type        constant;
    sigma       0.072;
}

