tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/coarse/constant/thermophysicalProperties.air
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

// Declared standard-property closure; exact constants are not tabulated.
thermoType
{
    type                heRhoThermo;
    mixture             pureMixture;
    transport           const;
    thermo              hConst;
    equationOfState     perfectGas;
    specie              specie;
    energy              sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight       28.97;
    }
    thermodynamics
    {
        Cp              1007;
        Hf              0;
    }
    transport
    {
        mu              1.78e-05;
        Pr              0.71;
    }
}

