tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/coarse/constant/turbulenceProperties.stage2
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Source states LES but does not report its coefficient/wall-model details.
simulationType  LES;

LES
{
    LESModel        Smagorinsky;
    turbulence      on;
    printCoeffs     on;
    delta           cubeRootVol;

    cubeRootVolCoeffs
    {
        deltaCoeff  1;
    }
}

