tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/coarse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     compressibleInterFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          1e-06;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxAlphaCo      0.25;

maxDeltaT       0.001;

functions
{
    probesJHR
    {
        type            probes;
        libs            ( sampling );
        writeControl    timeStep;
        writeInterval   20;
        probeLocations  ( ( 0 0.00997456 0 ) ( 0 0.00997456 0.3 ) ( 0 0.00997456 0.45 ) ( -0.8 0.00997456 0 ) ( -0.1 0.00997456 0 ) ( 0.1 0.00997456 0 ) );
        fields          ( p p_rgh alpha.water U );
    }
    fieldMinMax1
    {
        type            fieldMinMax;
        libs            ( fieldFunctionObjects );
        writeControl    timeStep;
        writeInterval   10;
        location        true;
        fields          ( p p_rgh U alpha.water );
    }
}


// ************************************************************************* //
